GetTypeOAPI (Note: Newer Function Available)
Syntax
SapObject.SapModel.LoadCases.GetTypeOAPI
VB6 Procedure
Function GetTypeOAPI(ByVal Name As String, ByRef CaseType As eLoadCaseType, ByRef SubType as long) As Long
Parameters
Name
The name of an existing load case.
CaseType
This is one of the following items in the eLoadCaseType enumeration.
CASE_LINEAR_STATIC = 1
CASE_NONLINEAR_STATIC = 2
CASE_MODAL = 3
CASE_RESPONSE_SPECTRUM = 4
CASE_LINEAR_HISTORY = 5 (Modal Time History)
CASE_NONLINEAR_HISTORY = 6 (Modal Time History)
CASE_LINEAR_DYNAMIC = 7 (Direct Integration Time History)
CASE_NONLINEAR_DYNAMIC = 8 (Direct Integration Time History)
CASE_MOVING_LOAD = 9
CASE_BUCKLING = 10
CASE_STEADY_STATE = 11
CASE_POWER_SPECTRAL_DENSITY = 12
CASE_LINEAR_STATIC_MULTISTEP = 13
CASE_HYPERSTATIC = 14
SubType
This is an integer representing the load case sub type. This item only applies for certain case types.
For CASE_NONLINEAR_STATIC:
1 = Nonlinear
2 = Nonlinear staged construction
For CASE_MODAL:
1 = Eigen
2 = Ritz
For CASE_LINEAR_HISTORY:
1 = Transient
2 = Periodic
Remarks
This function retrieves the case type for the specified load case.
The function returns zero if the type is successfully retrieved; otherwise it returns nonzero.
VBA Example
Sub GetLoadCaseType()
 'dimension variables
 Dim SapObject As Sap2000v15.SapObject
 Dim SapModel As cSapModel
 Dim ret As Long
 Dim CaseType As eLoadCaseType
 Dim SubType As Long
 'create Sap2000 object
 Set SapObject = New Sap2000v15.SapObject
 'start Sap2000 application
 SapObject.ApplicationStart
 'create SapModel object
 Set SapModel = SapObject.SapModel
 'initialize model
 ret = SapModel.InitializeNewModel
 'create model from template
 ret = SapModel.File.New2DFrame(PortalFrame, 2, 144, 2, 288)
 'get load case type
 ret = SapModel.LoadCases.GetTypeOAPI("DEAD", CaseType, SubType)
 'close Sap2000
 SapObject.ApplicationExit False
 Set SapModel = Nothing
 Set SapObject = Nothing
 End Sub
Release Notes
Initial release in version 11.02.
Changed nomenclature from Load Cases, Analysis Cases and Response Combinations to Load Patterns, Load Cases and Load Combinations, respectively, in version 12.00.
Added one item to the eLoadCaseType enumeration in version 12.00.
This function is obsolete and has been superseded by GetType_1 as of version 12.00. This function is maintained for backwards compatibility.
Changed function name to GetTypeOAPI in v17.0.0.
See Also